app/controllers/stage_controller.rb

INSERT INTO `stages` (`content_type`, `size`, `updated_at`, `filename`, `user_id`, `ischeck`, `parent_id`, `created_at`) VALUES('application/octet-stream', 0, '2009-10-27 19:30:07', 'video.flv', 1, NULL, NULL, '2009-10-27 19:30:07')
---
  def create
    #@user=User.find(:all, :conditions => {:id => params[:id]}, :order => 'created_at DESC')
    @stage = Stage.new(params[:stage])
    @stage.user_id=session[:user_id]

    if @stage.save

SELECT * FROM `stages` WHERE (`stages`.`user_id` = 1) ORDER BY created_at DESC
---
  def index
    @stages = Stage.find(:all, :conditions => {:user_id => session[:user_id]}, :order => 'created_at DESC')

SELECT * FROM `stages` WHERE (`stages`.`user_id` = 1) ORDER BY created_at DESC
---
  def show
      @stages = Stage.find(:all, :conditions => {:user_id => session[:user_id]}, :order => 'created_at DESC')