app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`activation_code` = '9517922ef1d990c380e04fed38ef1623fe09a24d') LIMIT 1
---
  def activate
    self.current_user = params[:activation_code].blank? ? :false : User.find_by_activation_code(params[:activation_code])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def find_user
    @user = User.find(params[:id])